# Reference: https://www.loc.gov/catdir/cpso/romanization/amharic.pdf

_transliteration = {
    'ሀ': ['ha'],
    'ሁ': ['hu'],
    'ሂ': ['hi'],
    'ሃ': ['hā'],
    'ሄ': ['hé'],
    'ህ': ['he', 'h'],
    'ሆ': ['ho'],
    ###########
    'ለ': ['la'],
    'ሉ': ['lu'],
    'ሊ': ['li'],
    'ላ': ['lā'],
    'ሌ': ['lé'],
    'ል': ['le', 'l'],
    'ሎ': ['lo'],
    ###########
    'ሐ': ['ha'],
    'ሑ': ['hu'],
    'ሒ': ['hi'],
    'ሓ': ['hā'],
    'ሔ': ['hé'],
    'ሕ': ['he', 'h'],
    'ሖ': ['ho'],
    ############
    'መ': ['ma'],
    'ሙ': ['mu'],
    'ሚ': ['mi'],
    'ማ': ['mā'],
    'ሜ': ['mé'],
    'ም': ['me', 'm'],
    'ሞ': ['mo'],
    ############
    'ሰ': ['sa'],
    'ሱ': ['su'],
    'ሲ': ['si'],
    'ሳ': ['sā'],
    'ሴ': ['sé'],
    'ስ': ['se', 's'],
    'ሶ': ['so'],
    ############
    'ነ': ['na'],
    'ኑ': ['nu'],
    'ኒ': ['ni'],
    'ና': ['nā'],
    'ኔ': ['né'],
    'ን': ['ne', 'n'],
    'ኖ': ['no'],
    ###########
    'አ': ['ʼa'],
    'ኡ': ['ʼu'],
    'ኢ': ['ʼi'],
    'ኣ': ['ʼā'],
    'ኤ': ['ʼé'],
    'እ': ['ʼe'],
    'ኦ': ['ʼo'],
    ############
    'ደ': ['da'],
    'ዱ': ['du'],
    'ዲ': ['di'],
    'ዳ': ['dā'],
    'ዴ': ['dé'],
    'ድ': ['de', 'd'],
    'ዶ': ['do'],
    ############
}


def romanize(input):
    output = ''
    for char in input:
        try:
            output += _transliteration[char][-1]
        except KeyError:
            output += char

    return output


if __name__ == '__main__':
    v = romanize('ሰላም እንደምን አለህ')
    print(v)
